app/controllers/combate_controller.rb

	def preparados

		coincidencias = User.count
		@random = 6
		@rival = User.where(:id => @random, :permiso => "usuario")
---
SELECT COUNT(*) FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? AND "users"."permiso" = ? AND "users"."id" = ? LIMIT 1  [["id", 3], ["permiso", "usuario"], ["id", 3]]