app/controllers/menu_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "test@test.cl"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "recursos".* FROM "recursos" INNER JOIN "recursos_users" ON "recursos"."id" = "recursos_users"."recurso_id" WHERE "recursos_users"."user_id" = ?  [["user_id", 6]]
SELECT "tropas".* FROM "tropas" INNER JOIN "tropas_users" ON "tropas"."id" = "tropas_users"."tropa_id" WHERE "tropas_users"."user_id" = ?  [["user_id", 6]]
---
  def menu_user #Se muestran los datos y estadísticas del usuario, además de tropas y recursos asociados
  	@user= User.where(:email => current_user.email)
  	@recursos = User.find(current_user.id).recursos
  	@tropas = User.find(current_user.id).tropas