app/controllers/recursos_controller.rb

SELECT "recursos".* FROM "recursos"
---
  def index
    @recursos = Recurso.all

INSERT INTO "recursos" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-22 21:25:39.146055"], ["nombre", "Oro"], ["updated_at", "2014-11-22 21:25:39.146055"]]
---
  def create
    @recurso = Recurso.new(recurso_params)
    @recurso.save

DELETE FROM "recursos" WHERE "recursos"."id" = ?  [["id", 7]]
---
  def destroy
    @recurso.destroy

SELECT  "recursos".* FROM "recursos" WHERE "recursos"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_recurso
      @recurso = Recurso.find(params[:id])