app/controllers/tropas_controller.rb

  def index
    @tropas = Tropa.all
---
SELECT "tropas".* FROM "tropas"

  def create
    @tropa = Tropa.new(tropa_params)
    @tropa.save
---
INSERT INTO "tropas" ("ataque", "costo", "created_at", "defensa", "historia", "nombre", "num_guerreros", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @tropa.update(tropa_params)
---
UPDATE "tropas" SET "nombre" = ?, "updated_at" = ? WHERE "tropas"."id" = 1  [["nombre", "Noxus"], ["updated_at", "2014-11-22 21:56:14.971694"]]

  def destroy
    @tropa.destroy
---
DELETE FROM "tropas" WHERE "tropas"."id" = ?  [["id", 4]]

    def set_tropa
      @tropa = Tropa.find(params[:id])
---
SELECT  "tropas".* FROM "tropas" WHERE "tropas"."id" = ? LIMIT 1  [["id", 4]]